#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["wallet-instances"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "containers_02" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlDatabases/db/containers/wallet-instances"
        name                = "wallet-instances"
        # (5 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 10000 -> 4000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded_02 will be created
  + resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded_02" {
      + auto_mitigate            = false
      + description              = "A collection throughput (RU/s) exceed provisioned throughput, and it's raising 429 errors. Please, consider to increase RU. Runbook: https://pagopa.atlassian.net/wiki/spaces/SIW/pages/1311735955/Runbook"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-wallet-cosno-02] Provisioned Throughput Exceeded"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02",
        ]
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01"
        }
      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "TotalRequestUnits"
          + metric_namespace       = "Microsoft.DocumentDB/databaseAccounts"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "Region"
              + operator = "Include"
              + values   = [
                  + "italynorth",
                ]
            }
          + dimension {
              + name     = "StatusCode"
              + operator = "Include"
              + values   = [
                  + "429",
                ]
            }
          + dimension {
              + name     = "CollectionName"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (23 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "32544b2f-b97d-4453-9555-1ad71630512c"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.func_app_support.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|reader"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "2108350b-f580-48dd-b433-966b5ddcfb44"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.func_app_support_slot[0].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|reader"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "f9d3f370-ca8c-435f-beda-f4ba156e2fb4"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.func_app_user_02.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

  # module.iam.module.func_app_user_slot_02[0].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-02|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "c827040b-ca8f-4749-8de1-66034756ebc3"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-02/dbs/db"
    }

Plan: 7 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
